Autodesk.Navisworks.Api.SearchConditionComparison
Specifies comparison operator used to see whether a Autodesk.Navisworks.Api.SearchCondition will match

Autodesk.Navisworks.Api.SearchConditionComparison.None
Never matches

Autodesk.Navisworks.Api.SearchConditionComparison.HasCategory
Matches if item has specified category

Autodesk.Navisworks.Api.SearchConditionComparison.NotHasCategory
Matches if item does not have specified category

Autodesk.Navisworks.Api.SearchConditionComparison.HasProperty
Matches if item has the specified property in the specified category

Autodesk.Navisworks.Api.SearchConditionComparison.NotHasProperty
Matches if item does not have the specified property in the specified category

Autodesk.Navisworks.Api.SearchConditionComparison.SameType
Matches if specified property exists and value has the same Autodesk.Navisworks.Api.VariantDataType

Autodesk.Navisworks.Api.SearchConditionComparison.Equal
Matches if specified property exists and has the same value

Autodesk.Navisworks.Api.SearchConditionComparison.NotEqual
Matches if specified property exists and does not have the same value

Autodesk.Navisworks.Api.SearchConditionComparison.NumericLessThan
Matches if specified property exists, has the same numeric Autodesk.Navisworks.Api.VariantDataType (Int32, AnyDouble, DateTime) and property value less than condition value

Autodesk.Navisworks.Api.SearchConditionComparison.NumericLessThanOrEqual
Matches if specified property exists, has the same numeric Autodesk.Navisworks.Api.VariantDataType (Int32, AnyDouble, DateTime) and property value less than or equal to condition value

Autodesk.Navisworks.Api.SearchConditionComparison.NumericGreaterThanOrEqual
Matches if specified property exists, has the same numeric Autodesk.Navisworks.Api.VariantDataType (Int32, AnyDouble, DateTime) and property value greater than or equal to condition value

Autodesk.Navisworks.Api.SearchConditionComparison.NumericGreaterThan
Matches if specified property exists, has the same numeric Autodesk.Navisworks.Api.VariantDataType (Int32, AnyDouble, DateTime) and property value greater than condition value

Autodesk.Navisworks.Api.SearchConditionComparison.DisplayStringContains
Matches if specified property exists, is of DisplayString type and contains the display string in condition value

Autodesk.Navisworks.Api.SearchConditionComparison.DisplayStringWildcard
Matches if specified property exists, is of DisplayString type and matches the wildcard display string in condition value

Autodesk.Navisworks.Api.SearchConditionComparison.DateTimeWithinDay
Matches if specified property exists, is of DateTime type and is within one day prior to the DateTime in condition value

Autodesk.Navisworks.Api.SearchConditionComparison.DateTimeWithinWeek
Matches if specified property exists, is of DateTime type and is within one week prior to the DateTime in condition value